app/Controllers/Admin.php

INSERT INTO `projects` (`title`, `description`, `image_path`, `url`, `team_members`, `class_section`, `created_at`, `updated_at`) VALUES ('test 5', 'test 5', 'uploads/thumbnails/1748074934_0a5338db70cd160d3f51.jpg', 'https://example.com', 'hjevf\r\nejfjbef\r\nefeh', 'BSIS 2A', '2025-05-24 16:22:14', '2025-05-24 16:22:14')
---
            // Temporarily disable validation for debugging
            $this->projectModel->skipValidation(true);

            $projectId = $this->projectModel->insert($data);

SELECT *
FROM `projects`
WHERE `projects`.`id` = '10'
---
    public function updateProject()
    {
        // Get project ID
        $projectId = $this->request->getPost('projectId');

        // Get the project from database
        $project = $this->projectModel->find($projectId);

UPDATE `projects` SET `title` = 'test 7', `description` = 'test 7', `url` = 'https://example.com', `team_members` = 'sdf\r\ndjfb\r\ndkfjgb', `class_section` = 'BSIS 2B', `updated_at` = '2025-05-24 16:55:14'
WHERE `projects`.`id` IN ('10')
---
            // Temporarily disable validation for debugging
            $this->projectModel->skipValidation(true);

            if (!$this->projectModel->update($projectId, $data)) {

SELECT *
FROM `projects`
WHERE `projects`.`id` = '2'
DELETE FROM `projects`
WHERE `id` IN ('2')
---
    public function deleteProject()
    {
        // Get project ID
        $projectId = $this->request->getPost('projectId');

        // Get the project from database
        $project = $this->projectModel->find($projectId);

        if (!$project) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Project not found'
            ]);
        }

        // Delete the image file if it exists
        if (!empty($project['image_path'])) {
            $imagePath = FCPATH . $project['image_path'];
            if (file_exists($imagePath)) {
                unlink($imagePath);
            }
        }

        // Delete from database
        if (!$this->projectModel->delete($projectId)) {

SELECT *
FROM `projects`
WHERE `projects`.`id` = '10'
---
    public function getProject($id)
    {
        $project = $this->projectModel->find($id);