app/Controllers/Home.php

SELECT *
FROM `projects`
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `projects`
---
    public function index()
    {
        $projectModel = new ProjectModel();

        // Set up pagination - 6 projects per page
        $projects = $projectModel->paginate(6, 'projects');

SELECT *
FROM `projects`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `projects`
---
    public function landing()
    {
        $projectModel = new ProjectModel();

        // Set up pagination - 6 projects per page
        $projects = $projectModel->paginate(6, 'projects');

SELECT *
FROM `projects`
WHERE   (
`title` LIKE '%test%' ESCAPE '!'
OR  `description` LIKE '%test%' ESCAPE '!'
OR  `class_section` LIKE '%test%' ESCAPE '!'
OR  `team_members` LIKE '%test%' ESCAPE '!'
 )
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE   (
`title` LIKE '%test%' ESCAPE '!'
OR  `description` LIKE '%test%' ESCAPE '!'
OR  `class_section` LIKE '%test%' ESCAPE '!'
OR  `team_members` LIKE '%test%' ESCAPE '!'
 )
---
    public function search()
    {
        $searchTerm = $this->request->getGet('term');
        $filter = $this->request->getGet('filter') ?? 'all';

        $projectModel = new ProjectModel();

        // Apply search term to query if provided
        if (!empty($searchTerm)) {
            $projectModel->groupStart()
                ->like('title', $searchTerm)
                ->orLike('description', $searchTerm)
                ->orLike('class_section', $searchTerm)
                ->orLike('team_members', $searchTerm)
                ->groupEnd();
        }

        // Apply filter if not 'all'
        if ($filter !== 'all') {
            $projectModel->where('class_section', $filter);
        }

        // Get paginated results
        $projects = $projectModel->paginate(6, 'projects');